app/controllers/api/expenses_controller.rb

    def create
        @expense = Expense.new(expense_params)
        if @expense.save
---
INSERT INTO "expenses" ("description", "amount", "split_type", "payer_id", "date_incurred", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @expense = Expense.find(params[:id])
        if @expense.update(expense_params)
---
SELECT "user_expenses".* FROM "user_expenses" WHERE "user_expenses"."expense_id" = $1  [["expense_id", 3]]
UPDATE "expenses" SET "description" = $1, "date_incurred" = $2, "updated_at" = $3 WHERE "expenses"."id" = $4  [["description", "soccer game 4"], ["date_incurred", "2022-05-03"], ["updated_at", "2022-05-05 20:02:46.839981"], ["id", 16]]

    def destroy
        @expense = Expense.includes(:expenders).find(params[:id])
        if @expense && @expense.destroy
---
SELECT "user_expenses".* FROM "user_expenses" WHERE "user_expenses"."expense_id" = $1  [["expense_id", 2]]
DELETE FROM "user_expenses" WHERE "user_expenses"."id" = $1  [["id", 3]]