app/controllers/api/friendships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "\"nick@gmail.com\""], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["friend_id", 7], ["created_at", "2022-04-28 19:44:04.254626"], ["updated_at", "2022-04-28 19:44:04.254626"]]
---
  def create

    @friend = User.find_by(email: friendship_params[:friend_email]);
    @user_id = friendship_params[:user_id].to_i
    if @friend
      @friendship = Friendship.new({user_id: friendship_params[:user_id], friend_id: @friend.id})
      @reverse_friendship = Friendship.new({user_id: @friend.id, friend_id: friendship_params[:user_id]})
      if @friendship.save && @reverse_friendship.save

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 7], ["friend_id", 6], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 39]]
---
  def destroy
    @user_id = current_user.id
    @friend_id = params[:id].to_i
    @friendship = Friendship.find_by(user_id: current_user.id, friend_id: params[:id])
    @reverse_friendship = Friendship.find_by(user_id: params[:id], friend_id: current_user.id)
    if @friendship && @reverse_friendship && @friendship.destroy && @reverse_friendship.destroy