app/controllers/api/sessions_controller.rb

  def create

    @user = User.includes(:friends, expenses: [:expenders]).find_by_credentials(
      params[:user][:username],
      params[:user][:password]
    )
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7)  [["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8], ["id", 9]]