app/views/api/sessions/_user.json.jbuilder

json.expenses do
    user.expenses.each do |expense|
---
SELECT "expenses".* FROM "expenses" INNER JOIN "user_expenses" ON "expenses"."id" = "user_expenses"."expense_id" WHERE "user_expenses"."user_id" = $1  [["user_id", 1]]